from ANNIEMUSIC import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🏓🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]

TAGMES = [ " *𝘌𝘯𝘢𝘬𝘶 𝘦𝘵𝘩𝘢𝘵𝘩𝘶 𝘰𝘳𝘶 𝘴𝘰𝘯𝘨 𝘥𝘦𝘥𝘪𝘤𝘢𝘵𝘦 𝘱𝘢𝘯𝘯𝘶😕* ",
           " *𝘌𝘳𝘶𝘮𝘢 𝘮𝘢𝘥𝘦 𝘪𝘷𝘭𝘰 𝘯𝘦𝘳𝘢𝘮𝘢 𝘦𝘯𝘨𝘢 𝘱𝘰𝘺𝘪 𝘵𝘩𝘰𝘭𝘢𝘯𝘫𝘢??🙃* ",
           " *𝘷𝘢𝘯𝘢𝘬𝘬𝘰 𝘷𝘢𝘯𝘢𝘬𝘬𝘰. 𝘦𝘯𝘯𝘢 𝘢𝘢𝘭𝘦 𝘱𝘢𝘬𝘢 𝘮𝘶𝘥𝘪𝘭𝘢😛* ",
           " *𝘠𝘢𝘳𝘳𝘢 𝘯𝘦𝘦. 𝘪𝘯𝘨𝘢 𝘪𝘳𝘶𝘯𝘵𝘩𝘶 𝘱𝘰𝘯𝘪𝘯𝘢 𝘬𝘰𝘭𝘢 𝘱𝘢𝘯𝘪𝘳𝘷𝘦𝘯 𝘶𝘯𝘯𝘢?🤔* ",
           " *𝘦𝘯𝘯𝘰𝘥𝘢 𝘣𝘰𝘴𝘴 𝘺𝘢𝘳𝘶𝘯𝘶 𝘶𝘯𝘢𝘬𝘶 𝘵𝘩𝘦𝘳𝘪𝘺𝘶𝘮𝘢. 𝘬𝘢𝘢𝘵𝘪 𝘬𝘰𝘥𝘶𝘵𝘩𝘶𝘳𝘢𝘢𝘵𝘩𝘢.?* ",
           " *𝘩𝘦𝘺 𝘤𝘩𝘦𝘭𝘭𝘢𝘮. 𝘦𝘯𝘯𝘢 𝘱𝘢𝘯𝘥𝘳𝘢.🤗* ",
           " *𝘏𝘦𝘢𝘳𝘵𝘉𝘦𝘢𝘵 𝘷𝘢 𝘧𝘶𝘯 𝘱𝘢𝘯𝘢𝘭𝘢𝘮😇* ",
           " *𝘢𝘥𝘢 𝘦𝘯𝘯𝘢𝘺𝘢 𝘯𝘦. 𝘦𝘱𝘰 𝘱𝘢𝘵𝘩𝘢𝘭𝘶𝘮 𝘵𝘩𝘶𝘯𝘨𝘪𝘵𝘦 𝘪𝘳𝘶𝘬𝘬𝘢🤭* ",
           " *𝘌𝘱𝘰 𝘱𝘢𝘳𝘶 𝘴𝘰𝘳𝘶 𝘴𝘰𝘳𝘶 𝘴𝘰𝘳𝘶𝘯𝘶🥺🥺* ",
           " *𝘕𝘢𝘯𝘯𝘨𝘢𝘭𝘢𝘮 𝘰𝘥𝘶𝘳𝘢 𝘵𝘳𝘢𝘪𝘯-𝘢 𝘰𝘯𝘦 𝘩𝘢𝘯𝘥-𝘭𝘢 𝘯𝘪𝘳𝘶𝘵𝘵𝘩𝘶𝘯𝘢𝘷𝘢𝘯𝘨𝘢😶* ",
           " *𝘈𝘥𝘪𝘤𝘩𝘪 𝘬𝘶𝘥𝘢 𝘬𝘦𝘱𝘢𝘯𝘨𝘢. 𝘱𝘢𝘰𝘷𝘶𝘮 𝘴𝘰𝘭𝘪𝘥𝘢𝘩𝘵𝘪𝘯𝘨𝘢🤔* ",
           " *𝘜𝘯 𝘮𝘢𝘯𝘥𝘢𝘺𝘢 𝘪𝘯𝘢𝘪𝘬𝘶 𝘱𝘰𝘭𝘢𝘬𝘢𝘮𝘢 𝘷𝘪𝘥𝘢 𝘮𝘢𝘵𝘦𝘯 𝘱𝘢𝘵𝘩𝘶𝘬𝘢😜* ",
           " *𝘝𝘢 𝘴𝘳𝘶𝘵𝘩𝘪 𝘱𝘰𝘭𝘢𝘮. 🙂* ",
           " *𝘯𝘦 𝘺𝘢𝘯 𝘪𝘯𝘵𝘩𝘢 𝘱𝘢𝘬𝘬𝘢𝘮 𝘢𝘷𝘭𝘰𝘷𝘢 𝘷𝘢𝘳𝘢 𝘮𝘢𝘵𝘶𝘬𝘢. 𝘦𝘯𝘯𝘢 𝘮𝘢𝘳𝘢𝘯𝘵𝘩𝘶𝘵𝘢𝘺𝘢😪* ",
           " *𝘯𝘪𝘤𝘦 𝘨𝘪𝘳𝘭. 𝘯𝘪𝘤𝘦 𝘥𝘱☺* ",
           " *𝘴𝘰𝘳𝘶 𝘬𝘰𝘵𝘵𝘪𝘬𝘪𝘯𝘢𝘺𝘢. 𝘯𝘢 𝘪𝘯𝘯𝘶𝘮 𝘬𝘰𝘵𝘵𝘪𝘬𝘢𝘭𝘢. 𝘷𝘢 𝘬𝘰𝘵𝘵𝘪𝘬𝘢𝘭𝘢𝘮🙊* ",
           " *𝘶𝘯𝘰𝘥𝘢 𝘪𝘯𝘵𝘳𝘰 𝘬𝘰𝘥𝘦𝘯. 𝘬𝘦𝘱𝘰𝘮??😺* ",
           " *𝘯𝘢𝘯𝘦 𝘬𝘰𝘻𝘩𝘢𝘯𝘵𝘩𝘢. 𝘦𝘯𝘯𝘢 𝘵𝘪𝘵𝘵𝘢𝘵𝘩𝘢🥲* ",
           " *𝘚𝘢𝘳𝘢𝘬𝘬𝘢𝘥𝘪𝘬𝘬𝘢𝘭𝘢𝘮𝘢.??😅* ",
           " *𝘌𝘯𝘯𝘰𝘥𝘢 𝘤𝘩𝘦𝘭𝘭𝘢𝘬𝘶𝘵𝘪-𝘬𝘶 𝘵𝘦𝘲𝘶𝘪𝘭𝘭𝘢 𝘳𝘰𝘮𝘣𝘢 𝘱𝘶𝘥𝘪𝘬𝘶𝘮😅* ",
           " *𝘌𝘯𝘯𝘰𝘥𝘢 𝘤𝘩𝘦𝘭𝘭𝘢𝘬𝘶𝘵𝘵𝘺 𝘴𝘢𝘳𝘢𝘬𝘬𝘢𝘥𝘪𝘬𝘢𝘭𝘢𝘯𝘢 𝘴𝘦𝘵𝘵𝘩𝘶𝘳𝘷𝘢, 𝘰𝘳𝘶 𝘲𝘶𝘢𝘵𝘦𝘳 𝘴𝘰𝘭𝘦𝘯😆😆😆* ",
           " *𝘖𝘊 𝘬𝘶𝘥𝘪𝘺𝘢 𝘪𝘳𝘶𝘯𝘵𝘩𝘢𝘭𝘶𝘮 𝘱𝘢𝘳𝘢𝘷𝘢 𝘪𝘭𝘭𝘢, 𝘷𝘢 𝘱𝘰𝘭𝘢𝘮😉* ",
           " *𝐈 𝐋𝐨𝐯𝐞 𝐘𝐨𝐮🙈🙈🙈* ",
           " *𝐃𝐨 𝐘𝐨𝐮 𝐋𝐨𝐯𝐞 𝐌𝐞..?👀* ",
           " *𝘌𝘯𝘯𝘢 𝘱𝘢𝘢𝘵𝘩𝘶 𝘪𝘱𝘥𝘪 𝘴𝘰𝘭𝘪𝘵𝘵𝘢𝘭𝘢🙉* ",
           " *𝘈𝘱𝘱𝘢𝘥𝘪 𝘴𝘰𝘭𝘭𝘪𝘵𝘢𝘭𝘢 𝘯𝘦.. 𝘳𝘰𝘮𝘣𝘢 𝘵𝘩𝘢😹* ",
           " *𝘰𝘯𝘭𝘪𝘯𝘦 𝘷𝘢𝘳𝘢 𝘶𝘯𝘢𝘬𝘶 𝘦𝘯𝘯𝘢𝘯 𝘬𝘢𝘴𝘵𝘢𝘮. 𝘪𝘳𝘶 𝘶𝘯 𝘮𝘢𝘯𝘥𝘢𝘺𝘢 𝘱𝘰𝘭𝘢𝘬𝘬𝘶𝘳𝘦𝘯😻* ",
           " *𝘐𝘯𝘴𝘵𝘢-𝘭𝘢 𝘦𝘯𝘯𝘢 𝘶𝘳𝘶𝘵𝘵𝘪𝘵𝘶 𝘪𝘳𝘶𝘬𝘬𝘢 𝘯𝘦𝘦??🙃* ",
           " *𝘜𝘯𝘯𝘰𝘥𝘢 𝘸𝘩𝘢𝘵𝘴𝘢𝘱𝘱 𝘯𝘶𝘮𝘣𝘦𝘳-𝘭𝘢𝘮 𝘬𝘦𝘬𝘢 𝘮𝘢𝘵𝘦𝘯. 𝘶𝘯𝘨𝘢 𝘢𝘮𝘮𝘢 𝘯𝘶𝘮𝘣𝘦𝘳 𝘬𝘰𝘥𝘶.?😕* ",
           " *𝘕𝘢 𝘵𝘩𝘦𝘳𝘪𝘺𝘢𝘮𝘢 𝘱𝘢𝘯𝘯𝘪𝘵𝘦𝘯. 𝘵𝘪𝘵𝘵𝘪𝘥𝘢𝘵𝘩𝘪𝘯𝘨𝘢.?🙃* ",
           " *𝘯𝘦𝘯𝘨𝘢 𝘪𝘯𝘨𝘢𝘺𝘦 𝘪𝘳𝘶𝘱𝘪𝘯𝘨𝘢𝘭𝘢. 𝘯𝘢𝘮𝘢 𝘥𝘢𝘪𝘭𝘺 𝘱𝘦𝘴𝘢𝘭𝘢𝘮?🙃* ",
           " *𝘕𝘢 𝘶𝘯𝘨𝘢 𝘧𝘳𝘯𝘥 𝘵𝘩𝘢𝘯𝘢. 𝘯𝘦𝘦𝘯𝘨𝘢 𝘦𝘯𝘯𝘢 𝘷𝘪𝘵𝘵𝘶 𝘱𝘰𝘪𝘳𝘷𝘪𝘯𝘨𝘢𝘭𝘢😊* ",
           " *𝘌𝘯𝘨𝘢 𝘪𝘳𝘶𝘬𝘬𝘪𝘯𝘨𝘢. 𝘦𝘯𝘢 𝘷𝘪𝘵𝘵𝘶 𝘦𝘯𝘨𝘢 𝘱𝘰𝘯𝘪𝘯𝘨𝘢🧐* ",
           " *𝘕𝘢 𝘬𝘶𝘺𝘪𝘭𝘢 𝘵𝘦𝘥𝘪 𝘱𝘰𝘯𝘦𝘯. 𝘯𝘦 𝘮𝘢𝘺𝘪𝘭𝘶 𝘦𝘯𝘨𝘢𝘯𝘶 𝘱𝘢𝘢𝘩𝘵𝘪𝘺𝘢.?* ",
           " *𝘕𝘢 𝘳𝘰𝘮𝘣𝘢 𝘬𝘦𝘵𝘵𝘢 𝘱𝘶𝘭𝘭𝘢. 𝘦𝘯𝘬𝘪𝘵𝘵𝘢 𝘷𝘢𝘤𝘩𝘪𝘬𝘢𝘵𝘩𝘢. 😠* ",
           " *𝘶𝘯𝘢𝘬𝘶 𝘦𝘯𝘯𝘢 𝘱𝘶𝘥𝘪𝘬𝘶𝘮𝘢 𝘪𝘭𝘢 𝘢𝘷𝘢𝘳𝘢 𝘱𝘶𝘥𝘪𝘬𝘶𝘮𝘢.. 𝘦𝘷𝘢𝘳𝘢𝘯𝘶 𝘬𝘦𝘬𝘢𝘵𝘩𝘢 𝘶𝘯𝘢𝘬𝘶 𝘦𝘯𝘯𝘢 𝘮𝘢𝘵𝘶𝘮 𝘵𝘩𝘢𝘯 𝘱𝘶𝘥𝘪𝘬𝘢𝘯𝘶𝘮..?❤* ",
           " *𝘕𝘦 𝘪𝘱𝘰𝘭𝘢𝘮 𝘳𝘰𝘮𝘣𝘢 𝘴𝘰𝘮𝘣𝘦𝘳𝘪 𝘢𝘢𝘨𝘪𝘵𝘢?👱* ",
           " *𝘜𝘯 𝘬𝘶𝘥𝘢 𝘴𝘦𝘳𝘯𝘵𝘩𝘢 𝘯𝘢𝘯𝘶𝘮 𝘶𝘳𝘶𝘱𝘢𝘥𝘢𝘮𝘢 𝘱𝘰𝘪𝘥𝘶𝘷𝘦𝘯𝘢𝘮. 𝘦𝘯𝘨𝘢 𝘢𝘮𝘮𝘢 𝘴𝘰𝘯𝘯𝘢𝘯𝘨𝘰🤧❣️* ",
           " *𝘢𝘥𝘪𝘺𝘦𝘦𝘦𝘪𝘪𝘪𝘪𝘪𝘪𝘪𝘪𝘪. 𝘦𝘯 𝘬𝘢𝘪𝘭𝘢 𝘰𝘳𝘶𝘯𝘢𝘢𝘭 𝘴𝘪𝘬𝘬𝘶𝘷𝘢𝘥𝘪😏😏* ",
           " *𝘶𝘯𝘬𝘪𝘵𝘵𝘢 𝘱𝘦𝘴𝘪 𝘫𝘦𝘺𝘪𝘬𝘬𝘢  𝘮𝘶𝘥𝘪𝘺𝘢𝘵𝘩𝘶𝘥𝘢 𝘴𝘢𝘮𝘺. 𝘢𝘢𝘭𝘢 𝘷𝘪𝘥𝘶🤐* ",
           " *𝘔𝘢𝘷𝘢𝘯𝘦 𝘬𝘢𝘪𝘭𝘢 𝘬𝘪𝘥𝘢𝘤𝘩𝘢.. 𝘤𝘩𝘢𝘵𝘯𝘪 𝘵𝘩𝘢𝘯. 😒* ",
           " *𝘏𝘦𝘢𝘳𝘵𝘣𝘦𝘢𝘵 𝘦𝘱𝘥𝘪 𝘪𝘳𝘶𝘬𝘬𝘦.😮😮* "
           " *𝘪𝘯𝘨𝘢 𝘰𝘳𝘶 𝘱𝘢𝘯𝘫𝘢𝘺𝘢𝘵𝘵𝘩𝘶. 𝘷𝘢𝘳𝘪𝘺𝘢 𝘴𝘢𝘯𝘥𝘢𝘪𝘬𝘶👀* ",
           " *𝘶𝘯𝘯𝘢 𝘱𝘢𝘢𝘵𝘩𝘢𝘭𝘦 𝘦𝘯𝘢𝘬𝘬𝘶 𝘷𝘦𝘬𝘬𝘢𝘮 𝘷𝘦𝘬𝘬𝘢𝘮𝘢 𝘷𝘢𝘳𝘶𝘵𝘩𝘶  🙈* ",
           " *𝘦𝘯𝘯𝘢 𝘮𝘢𝘤𝘩𝘢𝘢 𝘳𝘱𝘥𝘪𝘪𝘪𝘳𝘶𝘬𝘬𝘢. 𝘶𝘯 𝘬𝘰𝘷𝘢𝘮 𝘦𝘯𝘢𝘬𝘬𝘶 𝘴𝘰𝘨𝘢𝘮 ☹️* ",
           " *𝘶𝘯 𝘬𝘶𝘥𝘢 100 𝘷𝘢𝘳𝘶𝘴𝘢𝘮 𝘷𝘢𝘢𝘭𝘢𝘯𝘶𝘮 🥺🥺* ",
           " *𝘢𝘥𝘶𝘵𝘵𝘩𝘢𝘷𝘢𝘯 𝘤𝘩𝘢𝘵-𝘢 𝘦𝘵𝘵𝘪 𝘱𝘢𝘬𝘶𝘳𝘢𝘵𝘩𝘶 𝘵𝘩𝘢𝘱𝘱𝘶. 𝘯𝘦 𝘷𝘢 𝘯𝘢𝘮𝘢 𝘢𝘯𝘨𝘢 𝘱𝘰𝘭𝘢𝘮👀* ",
           " *𝘶𝘯𝘯𝘢 𝘦𝘯𝘯𝘢𝘭𝘢 𝘮𝘢𝘳𝘢𝘬𝘬𝘢 𝘮𝘶𝘥𝘪𝘺𝘢𝘭𝘢🙂* ",
           " *𝘕𝘦 𝘺𝘢𝘳𝘶𝘯𝘶 𝘪𝘯𝘨𝘢 𝘦𝘭𝘢𝘳𝘬𝘶𝘮 𝘵𝘩𝘦𝘳𝘪𝘺𝘶𝘮𝘢?🤔* ",
           " *𝘯𝘢 𝘶𝘯𝘯𝘢 𝘳𝘰𝘮𝘣𝘢 𝘮𝘪𝘴𝘴 𝘱𝘢𝘯𝘦𝘯 𝘯𝘦 𝘪𝘭𝘭𝘢𝘮𝘢.🥺* ",
           " *𝘕𝘢𝘢𝘯𝘨𝘢𝘭𝘢𝘮 𝘢𝘱𝘱𝘰𝘷𝘦 𝘢𝘱𝘥𝘪. 𝘪𝘱𝘰𝘭𝘢𝘮 𝘴𝘰𝘭𝘢𝘷𝘢 𝘷𝘦𝘯𝘶𝘮 𝘦𝘯 𝘵𝘰𝘮𝘢𝘵𝘰🥺🥺* ",
           " *𝘷𝘢𝘥𝘪 𝘦𝘯 𝘱𝘰𝘵𝘢𝘵𝘰. 𝘪𝘷𝘭𝘰 𝘯𝘢𝘢𝘭𝘢 𝘦𝘯𝘨𝘢 𝘱𝘰𝘯𝘢?🤭😅* ",
           " *𝘯𝘢 𝘣𝘰𝘵 𝘪𝘭𝘭𝘢 𝘩𝘶𝘮𝘢𝘯.𝘯𝘦𝘴𝘢𝘮𝘢 𝘵𝘩𝘢𝘯 𝘯𝘢𝘮𝘣𝘶𝘯𝘨𝘢😕* ",
           " *𝘯𝘢 𝘳𝘰𝘮𝘣𝘢 𝘱𝘢𝘴𝘢𝘬𝘬𝘢𝘳𝘪. 𝘬𝘰𝘯𝘫𝘢𝘮 𝘬𝘰𝘷𝘢𝘬𝘬𝘢𝘳𝘪𝘺𝘶𝘮.?👀* ",
           " *𝘦𝘯𝘨𝘢 𝘶𝘯𝘨𝘢 𝘷𝘦𝘦𝘵𝘶𝘬𝘶 𝘬𝘢𝘥𝘢𝘵𝘵𝘩𝘪𝘵𝘶 𝘱𝘪𝘥𝘳𝘪𝘯𝘨𝘢𝘭𝘢😼* ",
           " *𝘌𝘯𝘢𝘬𝘬𝘶 𝘦𝘱𝘱𝘢𝘷𝘶𝘮 𝘶𝘯𝘨𝘢 𝘯𝘪𝘯𝘢𝘪𝘱𝘱𝘶 𝘵𝘩𝘢𝘯. .?😸* ",
           " *𝘌𝘯𝘯𝘰𝘥𝘢 𝘩𝘦𝘢𝘳𝘵-𝘢 𝘯𝘦𝘦𝘯𝘨𝘢 𝘵𝘩𝘪𝘳𝘶𝘥𝘪𝘵𝘵𝘶 𝘱𝘰𝘪𝘳𝘪𝘯𝘨𝘢.??🙈* ",
           " *𝘔𝘢𝘮𝘢 𝘔𝘢𝘮𝘢 𝘰𝘳𝘶 𝘴𝘦𝘪𝘵𝘩𝘪 𝘴𝘰𝘯𝘯𝘦. 𝘢𝘵𝘩𝘶 𝘷𝘢𝘯𝘵𝘩𝘶𝘤𝘩𝘢 𝘷𝘢𝘳𝘢𝘭𝘢𝘺𝘢 ✌️🤞* ",
           " *𝘔𝘢𝘵𝘯𝘢𝘥𝘢 𝘦𝘯 𝘣𝘢𝘮𝘣𝘢𝘳𝘢𝘬𝘢𝘵𝘵𝘢 𝘮𝘢𝘯𝘥𝘢𝘺𝘢?🥰* ",
           " *𝘕𝘢𝘢 𝘵𝘩𝘢𝘯 𝘪𝘳𝘶𝘬𝘬𝘦𝘯𝘭𝘢🥺🥺* ",
           " *𝘌𝘯𝘢𝘬𝘬𝘶 𝘶𝘯𝘨𝘢𝘭𝘢 𝘱𝘢𝘬𝘢𝘯𝘶𝘮 𝘱𝘰𝘭𝘢 𝘪𝘳𝘶𝘬𝘬𝘶. 🥲* ",
           " *𝘕𝘦𝘦𝘯𝘨𝘢 𝘴𝘪𝘯𝘨𝘭𝘦-𝘢 . 𝘷𝘢𝘯𝘨𝘢 𝘤𝘰𝘮𝘮𝘪𝘵 𝘢𝘢𝘨𝘢𝘭𝘢𝘮😉* ",
           " *𝘶𝘯𝘨𝘢𝘭𝘶𝘬𝘶 𝘦𝘯 𝘮𝘦𝘭𝘢 𝘱𝘢𝘢𝘴𝘢𝘮𝘦 𝘪𝘭𝘭𝘢😋🥳* ",
           " *𝘕𝘦 𝘤𝘩𝘦𝘭𝘭𝘢𝘮 𝘮𝘢𝘵𝘵𝘶𝘮 𝘪𝘭𝘭𝘢. 𝘳𝘰𝘮𝘣𝘢 𝘬𝘶𝘭𝘭𝘢𝘮🧐* ",
           " *𝘕𝘢 𝘦𝘵𝘩𝘪𝘳𝘱𝘢𝘢𝘵𝘩𝘢 𝘢𝘭𝘢𝘷𝘶 𝘯𝘦𝘦𝘯𝘨𝘢 𝘸𝘰𝘳𝘵𝘩-𝘢 𝘪𝘭𝘭𝘢𝘺𝘦🥺* ",
           " *𝘕𝘦𝘦𝘯𝘨𝘢 𝘦𝘯𝘯𝘢 𝘱𝘢𝘢𝘬𝘢-[@𝘏𝘦𝘢𝘳𝘵𝘉𝘦𝘢𝘵_𝘔𝘶𝘻𝘪𝘤]  𝘪𝘯𝘨𝘢 𝘷𝘢𝘳𝘪𝘯𝘨𝘢𝘭𝘢🤭🤭* ",
           " *𝐓𝐫𝐮𝐭𝐡 𝐀𝐧𝐝 𝐃𝐚𝐫𝐞 𝘷𝘪𝘭𝘢𝘺𝘢𝘢𝘥𝘪𝘳𝘬𝘪𝘯𝘨𝘢𝘭𝘢..? 😊* ",
           " *𝘶𝘯𝘨𝘢 𝘬𝘶𝘥𝘢 𝘱𝘦𝘴𝘶𝘯𝘢 𝘮𝘶𝘮𝘮𝘺 𝘢𝘥𝘪𝘱𝘱𝘢𝘯𝘨𝘢🥺🥺* ",
           " *𝘌𝘯𝘯𝘱𝘥𝘢 𝘣𝘪𝘰 𝘤𝘩𝘦𝘤𝘬 𝘱𝘢𝘯𝘪𝘯𝘨𝘢𝘭𝘢 𝘯𝘦𝘦𝘯𝘨𝘢🤗* ",
           " *𝘕𝘦𝘦𝘯𝘨𝘢 𝘦𝘱𝘥𝘪 𝘪𝘷𝘭𝘰 𝘢𝘭𝘢𝘨𝘢𝘷𝘶𝘮 𝘢𝘳𝘪𝘷𝘢𝘢𝘷𝘶𝘮 𝘱𝘦𝘴𝘶𝘳𝘪𝘯𝘨𝘢😗😗* ",
           " *𝘖𝘳𝘶 𝘱𝘰𝘯𝘯𝘢 𝘦𝘱𝘥𝘪 𝘶𝘴𝘢𝘳 𝘱𝘢𝘯𝘢𝘯𝘶𝘮𝘯𝘶 𝘶𝘯𝘨𝘢𝘭𝘶𝘬𝘶 𝘵𝘩𝘦𝘳𝘪𝘺𝘶𝘮𝘢🥺* ",
           " *𝘛𝘩𝘶𝘬𝘬𝘢𝘵𝘩𝘶𝘭𝘢 𝘬𝘶𝘥𝘢 𝘦𝘯𝘯𝘢 𝘯𝘪𝘯𝘢𝘤𝘩𝘪𝘵𝘦 𝘵𝘩𝘶𝘯𝘨𝘢𝘯𝘶𝘮 𝘯𝘦𝘦🥺* ",
           " *𝘌𝘯𝘯𝘢 𝘬𝘢𝘳𝘶𝘮𝘢𝘮 𝘷𝘦𝘯𝘢𝘭𝘶𝘮 𝘱𝘢𝘯𝘶. 𝘢𝘯𝘢 𝘪𝘯𝘵𝘩 𝘢𝘭𝘶𝘷 𝘮𝘢𝘵𝘶𝘮 𝘱𝘢𝘯𝘪𝘥𝘢𝘵𝘩𝘢😜* ",
           " *𝘌𝘭𝘭𝘢𝘳𝘶𝘮 𝘦𝘯𝘯𝘢 𝘯𝘢𝘮𝘣𝘢 𝘮𝘢𝘢𝘵𝘳𝘢𝘯𝘨𝘢. 𝘯𝘢𝘯𝘶𝘮 𝘮𝘢𝘯𝘶𝘴𝘪 𝘵𝘩𝘢𝘢𝘯𝘢🥰*",
           "𝘝𝘢𝘯𝘢𝘬𝘬𝘰.. 𝘶𝘯𝘢𝘬𝘦𝘯𝘯𝘢𝘥𝘢 𝘵𝘩𝘶𝘬𝘬𝘢𝘮 𝘪𝘱𝘰𝘷𝘦.𝘈𝘥𝘪𝘯𝘨𝘨 𝘋𝘢𝘮𝘴𝘢𝘬𝘬𝘢𝘯𝘯𝘢.🤣",
          " 𝘕𝘦𝘳𝘢𝘮 𝘢𝘢𝘤𝘩𝘶𝘯𝘢 𝘷𝘢𝘯𝘵𝘩𝘶𝘥𝘳𝘢𝘯𝘶𝘯𝘨𝘢 𝘬𝘢𝘥𝘢𝘺𝘢 𝘴𝘢𝘵𝘵𝘩𝘪𝘵𝘶 𝘬𝘦𝘭𝘢𝘮𝘣𝘪𝘵𝘢𝘯𝘨𝘢𝘭𝘢 𝘪𝘭𝘢𝘺𝘢𝘯𝘶 𝘱𝘢𝘬𝘢𝘯𝘶𝘯𝘢 😒",
          "𝘐𝘱𝘰 𝘦𝘭𝘶𝘯𝘵𝘩𝘶 𝘷𝘢𝘳𝘢 𝘱𝘰𝘳𝘢𝘺𝘢 𝘪𝘭𝘢 𝘶𝘯 𝘮𝘢𝘯𝘥𝘢𝘪𝘭𝘢 𝘮𝘰𝘭𝘢𝘨𝘢 𝘢𝘳𝘢𝘪𝘬𝘢𝘷𝘢👿",
          "𝘛𝘩𝘰𝘰𝘯𝘨𝘪 𝘵𝘩𝘰𝘰𝘯𝘨𝘪𝘺𝘦 𝘱𝘢𝘢𝘵𝘩𝘪 𝘱𝘦𝘳𝘢 𝘷𝘦𝘳𝘢𝘵𝘵𝘪𝘵𝘢. 𝘔𝘦𝘦𝘵𝘩𝘪 𝘱𝘦𝘳𝘢𝘺𝘶𝘮 𝘷𝘦𝘳𝘢𝘵𝘵𝘢 𝘱𝘭𝘢𝘯 𝘱𝘢𝘯𝘥𝘳𝘪𝘺𝘢😤😤",
          "𝘕𝘢𝘯𝘨𝘢 𝘱𝘰𝘷𝘰𝘮 𝘪𝘭𝘢 𝘪𝘯𝘨𝘢𝘺𝘦 𝘱𝘢𝘢𝘪 𝘷𝘪𝘳𝘪𝘤𝘩𝘪 𝘱𝘢𝘥𝘶𝘱𝘰𝘮. 𝘜𝘯𝘨𝘢𝘭𝘶𝘬𝘦𝘯𝘯𝘢🤭🤭",
          "𝘕𝘪𝘵 𝘧𝘶𝘭𝘭𝘢 𝘳𝘰𝘮𝘢𝘯𝘤𝘦 𝘱𝘢𝘯𝘢 𝘵𝘩𝘶𝘬𝘬𝘢𝘮 𝘷𝘢𝘳𝘵𝘩𝘶𝘯𝘶 𝘴𝘰𝘭𝘢 𝘷𝘦𝘯𝘥𝘪𝘺𝘢𝘵𝘩𝘶 🔪",
          "𝘒𝘢𝘥𝘩𝘢𝘭 𝘱𝘢𝘯𝘥𝘳𝘢𝘱𝘰 𝘷𝘢𝘳𝘢𝘵𝘩𝘢 𝘵𝘩𝘶𝘬𝘬𝘢𝘮 𝘪𝘱𝘰 𝘮𝘢𝘵𝘶𝘮 𝘦𝘱𝘥𝘪𝘥𝘢 𝘷𝘢𝘳𝘵𝘩𝘶🥱",
          "𝘒𝘢𝘥𝘩𝘢𝘭 𝘬𝘦𝘦𝘵𝘩𝘢𝘭𝘯𝘶 𝘱𝘢𝘯𝘪𝘵𝘶 𝘵𝘩𝘶𝘬𝘬𝘢𝘮 𝘬𝘦𝘦𝘬𝘢𝘮𝘯𝘶 𝘴𝘰𝘯𝘯𝘢. 𝘈𝘥𝘪𝘤𝘩𝘪 𝘥𝘢𝘮𝘢𝘭 𝘱𝘢𝘯𝘪𝘥𝘶𝘷𝘦𝘯 𝘶𝘯𝘯𝘢 😡",
          "𝘚𝘢𝘳𝘢𝘬𝘢𝘥𝘪𝘬𝘢𝘭𝘢𝘮 𝘵𝘩𝘶𝘯𝘨𝘢𝘵𝘩𝘢 🍻",
          "𝘒𝘢𝘯𝘢𝘷𝘶𝘭𝘢 𝘯𝘢 𝘷𝘢𝘳𝘦𝘯 🤗",
          "𝘛𝘩𝘶𝘯𝘨𝘶𝘳𝘢𝘷𝘢𝘯 𝘵𝘩𝘢𝘭𝘢𝘪𝘭𝘢 𝘧𝘢𝘯 𝘬𝘢𝘭𝘢𝘯𝘥𝘶 𝘷𝘪𝘭𝘶𝘮😝",
          "𝘝𝘪𝘵𝘢𝘵𝘵𝘩𝘢 𝘱𝘢𝘢𝘵𝘩𝘶 𝘱𝘢𝘥𝘶𝘬𝘢𝘵𝘩𝘢 𝘰𝘥𝘶 𝘱𝘶𝘳𝘪𝘯𝘫𝘪 𝘮𝘢𝘯𝘥𝘢𝘪𝘭𝘢 𝘷𝘪𝘭𝘢 𝘱𝘰𝘵𝘩𝘶 😝",
          "𝘶𝘯 𝘒𝘢𝘯𝘢𝘷𝘶𝘭𝘢 𝘬𝘶𝘥𝘢 𝘮𝘢 𝘵𝘩𝘢𝘯 𝘷𝘢𝘳𝘶𝘷𝘦𝘯 🫶🏻",
          "𝘛𝘩𝘢𝘮𝘣𝘪 𝘮𝘢𝘯𝘪 𝘪𝘯𝘯𝘶𝘮 𝘢𝘨𝘢𝘭𝘢. 𝘈𝘵𝘩𝘶𝘬𝘶𝘭𝘭𝘢 𝘦𝘯𝘨𝘢 𝘱𝘰𝘳𝘪𝘯𝘨𝘢🌝",
           ]

@app.on_message(filters.command(["tagall"], prefixes=["/","!"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("𝐓𝐡𝐢𝐬 𝐂𝐨𝐦𝐦𝐚𝐧𝐝 𝐎𝐧𝐥𝐲 𝐅𝐨𝐫 𝐆𝐫𝐨𝐮𝐩𝐬.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 . ")

    if message.reply_to_message and message.text:
        return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ...")
    else:
        return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ..")
    if chat_id in spam_chats:
        return await message.reply("𝐏𝐥𝐞𝐚𝐬𝐞 𝐀𝐭 𝐅𝐢𝐫𝐬𝐭 𝐒𝐭𝐨𝐩 𝐑𝐮𝐧𝐧𝐢𝐧𝐠 𝐏𝐫𝐨𝐜𝐞𝐬𝐬 ...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(TAGMES)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass

@app.on_message(filters.command(["cancel", "cancel"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("𝐂𝐮𝐫𝐫𝐞𝐧𝐭𝐥𝐲 𝐈'𝐦 𝐍𝐨𝐭 ..")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 𝐓𝐚𝐠 𝐌𝐞𝐦𝐛𝐞𝐫𝐬.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("**🦋Stopped Mention.....🫠**")
